# QUIZ

Q-1-In order to use a sub select query within an IN() function, what criteria must be met?
A-1-->The sub select query must return a single column.

Q-2-->What data types can be passed into the GENERATE_SERIES() function?
A-2-->numeric or timestamp

Q-3->Which symbols are used to cast values from one data type to another in PostgreSQL
A-3-->::

Q-4-->You have a column of values named 'data' that contains the numbers 10, 20, 30, 40, 50. What would be the result of this function? lag(data, 1) over (order by data)

A-4-->
null, 10, 20, 30, 40
Correct

The LAG() window function shifts values down the specified number of rows.

-------------------
20, 30, 40, 50, null
Incorrect

This would be the result of the LEAD() window function.



Q-5-->The ROW_NUMBER() function requires which additional clause?

A-5-->OVER
Correct

As a window function, the ROW_NUMBER() function requires an OVER clause.

In [1]:
from sqlalchemy import create_engine
import pandas as pd
# connection string: driver://username:password@server/database
engine = create_engine('postgresql+psycopg2://postgres:password@localhost/two_three')

In [2]:
pd.read_sql_query('select * from inventory.products', engine).head(3)

      sku product_name  category_id  size  price
0  ALB008     Delicate            1     8  10.99
1  ALB032     Delicate            1    32  18.99
2  ALB064     Delicate            1    64  22.99

In [3]:
#ADD NUMBERS TO COLUMNS
#ROW_NUMBER()
#problem independently added
pd.read_sql_query(
        '''
        SELECT sku,product_name,size,
                ROW_NUMBER() OVER (ORDER BY sku)
        FROM inventory.products
        ''', engine).head(10)

      sku       product_name  size  row_number
0  ALB008           Delicate     8           1
1  ALB032           Delicate    32           2
2  ALB064           Delicate    64           3
3  ALB128           Delicate   128           4
4   BI008  Basil-Infused EVO     8           5
5   BI016  Basil-Infused EVO    16           6
6   BI032  Basil-Infused EVO    32           7
7   EV008       Extra Virgin     8           8
8   EV016       Extra Virgin    16           9
9   EV032       Extra Virgin    32          10

In [4]:
#add number dependent product_name,
#row number increase among same product name classification
pd.read_sql_query(
        '''
        SELECT sku,product_name,size,
                ROW_NUMBER() OVER (partition by product_name ORDER BY sku)
        FROM inventory.products
        ''', engine).sample(10)

        sku          product_name  size  row_number
105  REF128               Refined   128           5
100  PUR128                  Pure   128           5
2     BI032     Basil-Infused EVO    32           3
33   KRN008             Koroneiki     8           1
50   LGT128                 Light   128           5
12   ALB032              Delicate    32           2
19    EV128          Extra Virgin   128           5
52    MI016  Mandarin-Infused EVO    16           2
107   RI016  Rosemary-Infused EVO    16           2
91   PIC008                Picual     8           1

In [5]:
pd.read_sql_query('select * from sales.orders', engine).head(3)

   order_id  order_date customer_id
0       100  2021-03-15       BX305
1       101  2021-03-17       GR208
2       102  2021-03-19       BV446

In [6]:

import psycopg2
pgconn = psycopg2.connect(host="localhost", database="two_three",user="postgres",password="password")#hide password

#Creating a cursor object using the cursor() method
cursor = pgconn.cursor()

In [10]:
#CAST complete,miss_macth data type

#:: change datatype 
#ecxample--
cursor.execute("""
    SELECT * FROM sales.orders;
""")
result = cursor.fetchall();
cnt=0
for i in result:
    cnt+=1
    if cnt > 5:
        break
    print(i)

(100, datetime.date(2021, 3, 15), 'BX305')
(101, datetime.date(2021, 3, 17), 'GR208')
(102, datetime.date(2021, 3, 19), 'BV446')
(103, datetime.date(2021, 3, 19), 'BV446')
(104, datetime.date(2021, 3, 20), 'FV418')

In [11]:
#change data type :: from date to text
cursor.execute("""
    select order_id,
        order_date::text,
        customer_id
    from sales.orders;
""")
result = cursor.fetchall();
cnt=0
for i in result:
    cnt+=1
    if cnt > 5:
        break
    print(i)

(100, '2021-03-15', 'BX305')
(101, '2021-03-17', 'GR208')
(102, '2021-03-19', 'BV446')
(103, '2021-03-19', 'BV446')
(104, '2021-03-20', 'FV418')

In [12]:
pgconn.commit()
pgconn.close()

In [15]:
##LEAD LAG ,same date need to convert into 
#LAG(order_data,1)-->number of data move up or down
#LEAD shifts up to column
pd.read_sql_query(
        '''
select order_id,
    customer_id,
    order_date,
    lag(order_date, 1) over(partition by customer_id order by order_id)
        as "previous order date",
    lead (order_date, 1) over(partition by customer_id order by order_id)
        as "next order",
    lead (order_date, 1) over(partition by customer_id order by order_id) - 
        order_date as "time between orders"
from sales.orders
order by customer_id, order_date;
        ''', engine).sample(10)

,order_id,customer_id,order_date,previous order date,next order,time between orders
32,106,FV418,2021-03-22,2021-03-20,2021-03-27,5.0
29,157,DF600,2021-04-28,2021-04-21,2021-04-29,1.0
16,121,BX305,2021-04-01,2021-03-31,2021-04-11,10.0
51,160,GR208,2021-04-30,2021-04-26,None,NaN
26,137,DF600,2021-04-14,2021-04-07,2021-04-15,1.0
4,123,BV446,2021-04-05,2021-03-28,2021-04-05,0.0
2,112,BV446,2021-03-26,2021-03-19,2021-03-28,2.0
57,135,WR421,2021-04-14,2021-04-10,2021-04-23,9.0
20,151,BX305,2021-04-25,2021-04-16,2021-04-29,4.0
56,129,WR421,2021-04-10,2021-04-09,2021-04-14,4.0

In [17]:
#in fucntion SUBqueries


pd.read_sql_query(
        '''

select *
from inventory.products
where product_name ='Delicate'
       or product_name='Bold'
       or product_name='Light'
        ;

        ''', engine).sample(10)

       sku product_name  category_id  size  price
3   ALB128     Delicate            1   128  26.99
9   LGT008        Light            1     8   8.99
11  LGT032        Light            1    32  16.99
0   ALB008     Delicate            1     8  10.99
10  LGT016        Light            1    16  12.99
7   HOJ064         Bold            1    64  23.99
8   HOJ128         Bold            1   128  27.99
5   HOJ016         Bold            1    16  15.99
1   ALB032     Delicate            1    32  18.99
2   ALB064     Delicate            1    64  22.99

In [18]:
#better version with IN function,WHILE logic
pd.read_sql_query(
        '''
-- us an in() function with a list
select *
from inventory.products
where product_name in('Delicate', 'Bold', 'Light');

        ''', engine).sample(10)

       sku product_name  category_id  size  price
8   HOJ128         Bold            1   128  27.99
10  LGT016        Light            1    16  12.99
4   HOJ008         Bold            1     8  11.99
5   HOJ016         Bold            1    16  15.99
2   ALB064     Delicate            1    64  22.99
7   HOJ064         Bold            1    64  23.99
12  LGT064        Light            1    64  20.99
6   HOJ032         Bold            1    32  19.99
1   ALB032     Delicate            1    32  18.99
9   LGT008        Light            1     8   8.99

In [20]:
#Subquery IN function
pd.read_sql_query(
        '''
-- use an in function with a sub select query

select *
from inventory.products
where product_name in(
                    select product_name
                    from inventory.products
                    group by product_name
                    having count(*) >= 5)
                    ;


        ''', engine).head(10)

      sku      product_name  category_id  size  price
0   EV008      Extra Virgin            1     8   8.99
1   EV016      Extra Virgin            1    16  12.99
2   EV032      Extra Virgin            1    32  16.99
3   EV064      Extra Virgin            1    64  20.99
4   EV128      Extra Virgin            1   128  24.99
5  FCP008  First Cold Press            1     8   8.99
6  FCP016  First Cold Press            1    16  12.99
7  FCP032  First Cold Press            1    32  16.99
8  FCP064  First Cold Press            1    64  20.99
9  FCP128  First Cold Press            1   128  24.99

In [25]:
#SERIES
pd.read_sql_query(
        '''
SELECT  GENERATE_SERIES(10,20,3);
 
SELECT * FROM  GENERATE_SERIES(10,20,3)


        ''', engine).head(10)

   generate_series
0               10
1               13
2               16
3               19

In [27]:
#SERIES
#generate series from 3 to 10000 with 10 steps,compare with order_id get matched ones.
pd.read_sql_query(
        '''
SELECT *
FROM sales.orders
WHERE order_id IN(
                    SELECT GENERATE_SERIES(3,10000,10)
                    )
ORDER BY order_id;


        ''', engine).head(10)

   order_id  order_date customer_id
0       103  2021-03-19       BV446
1       113  2021-03-27       FV418
2       123  2021-04-05       BV446
3       133  2021-04-12       BV446
4       143  2021-04-19       BV446
5       153  2021-04-26       BV446

In [30]:
#change datetype
pd.read_sql_query(
        '''
select * 
from sales.orders
where order_date in(
                    select generate_series('2021-03-15'::timestamp, 
                                            '2021-03-31'::timestamp,
                                            '5 days')
                    )
order by order_id;


        ''', engine).head(10)

   order_id  order_date customer_id
0       100  2021-03-15       BX305
1       104  2021-03-20       FV418
2       109  2021-03-25       GR208
3       110  2021-03-25       BX305
4       119  2021-03-30       GR208

### challenge

*Use public.people_heights to sort each person by their hight

*Find out how much taller each person is than the person below

In [43]:
pd.read_sql_query('select * from public.people_heights  order by height_inches DESC', engine).head(10)

   person_id       name  height_inches gender
0        201  Marcellus          76.87      m
1        370      Steph          74.74      m
2        385     Joesph          74.71      m
3        272      Jorge          74.61      m
4        283    Shelton          74.32      m
5        397    Derrick          74.17      m
6        308      Rufus          74.09      m
7        154         Bo          74.00      m
8        317      Kasha          73.83      f
9          3        Dee          73.75      m

In [40]:
#LEAD show above
#LAG show below
pd.read_sql_query(
        '''
    SELECT person_id,
           name,
           height_inches,
           
           lag(name, 1) over (order by height_inches) as "is taller than",
            height_inches - lag(height_inches, 1) over (order by height_inches)
            as "by this many inches"

from public.people_heights
order by height_inches desc;


        ''', engine).head(10)

   person_id       name  height_inches is taller than  by this many inches
0        201  Marcellus          76.87          Steph                 2.13
1        370      Steph          74.74         Joesph                 0.03
2        385     Joesph          74.71          Jorge                 0.10
3        272      Jorge          74.61        Shelton                 0.29
4        283    Shelton          74.32        Derrick                 0.15
5        397    Derrick          74.17          Rufus                 0.08
6        308      Rufus          74.09             Bo                 0.09
7        154         Bo          74.00          Kasha                 0.17
8        317      Kasha          73.83            Dee                 0.08
9          3        Dee          73.75            Ian                 0.04